src/InformationRegisters/НастройкиОрганизацийМЭДО/НастройкиОрганизацийМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОрганизацийМЭДО</name>
  <resources>
    <name>АдресМЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидВходящегоДокументаПоУмолчанию</name>
    <comment>Специфичен для конфигурации Документооборот, при внедрении в другую конфигурацию может быть не актуален</comment>
    <type>
      <types>DefinedType.ВидДокументаМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>ГрифИнформацияОграниченногоРаспространения</name>
    <type>
      <types>DefinedType.ГрифДоступаМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>ГрифОбычнаяИнформация</name>
    <type>
      <types>DefinedType.ГрифДоступаМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторМЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогОтправкиFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогПолучения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогПолученияFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеМЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерПорции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОбмена</name>
    <type>
      <types>EnumRef.СпособыОбменаМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>ШтампВысота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтампСверху</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтампСлева</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтампШирина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СпособыОбменаМЭДО/СпособыОбменаМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОбменаМЭДО</name>
  <enumValues>
    <name>ДискСеть</name>
  </enumValues>
  <enumValues>
    <name>FTP</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/НастройкиОрганизацийМЭДО/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриСозданииНаСервереРедакцииКонфигурации();
	
	Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация) Тогда
		
		ЗаписьВРегистре = РегистрыСведений.НастройкиОрганизацийМЭДО.СоздатьМенеджерЗаписи();
		ЗаписьВРегистре.Организация = Параметры.Организация;
		ЗаписьВРегистре.Прочитать();
		
		Если ЗначениеЗаполнено(ЗаписьВРегистре.Организация) Тогда
			ЗначениеВДанныеФормы(ЗаписьВРегистре, Запись);
		Иначе // Нет в БД, это новая запись:
			Запись.Организация = Параметры.Организация;
			Запись.НаименованиеМЭДО = ИнтеграцияСМЭДО.НаименованиеЮрлицаНаДату(Параметры.Организация, ТекущаяДатаСеанса());
			Запись.ШтампСлева = 10; // по умолчанию.
			Запись.ШтампСверху = 10; // по умолчанию.
			Запись.СпособОбмена = Перечисления.СпособыОбменаМЭДО.ДискСеть;
			Запись.РазмерПорции = 50; // по умолчанию.
		КонецЕсли;
		
	КонецЕсли;
	
	ДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписьНастроекМЭДО", Запись.Организация, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособОбменаПриИзменении(Элемент)
	
	ДоступностьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДоступностьВидимость()
	
	Элементы.ГруппаДискСеть.Видимость	= (Запись.СпособОбмена = Перечисления.СпособыОбменаМЭДО.ДискСеть);
	Элементы.ГруппаFTP.Видимость	= (Запись.СпособОбмена = Перечисления.СпособыОбменаМЭДО.FTP);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереРедакцииКонфигурации()
	
	Элементы.НаименованиеМЭДО.Заголовок = 
		СтрШаблон(НСтр("ru = 'Наименование %1 для МЭДО'"), ИнтеграцияСМЭДО.ОрганизацииРодительный());
	
КонецПроцедуры

#КонецОбласти
